[
  {
    "id": 1,
    "company": "The Arab Energy Fund",
    "name": "Fahad Alshahriani",
    "title": "Chief Technology Officer",
    "quote": "Systems Limited has been instrumental in transforming our digital banking capabilities. Their expertise in core modernization has enabled us to deliver exceptional customer experiences while maintaining the highest security standards.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 2,
    "company": "Meethaq Islamic Banking",
    "name": "Shamzani Mohammed Hussain",
    "title": "Head of Digital Transformation",
    "quote": "The digital banking transformation delivered by Systems Limited has revolutionized how we serve our customers. The mobile-first approach has significantly increased customer engagement and satisfaction.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 3,
    "company": "Oman Housing Bank",
    "name": "Moosa Al Jadidi",
    "title": "Chief Information Officer",
    "quote": "Working with Systems Limited on our cloud migration has been exceptional. Their managed services ensure our systems run smoothly while we focus on growing our business and serving customers better.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 4,
    "company": "Country Model Banks",
    "name": "Ramki Ramakrishnan",
    "title": "Head of Technology",
    "quote": "The consulting services provided by Systems Limited helped us navigate complex regulatory requirements while implementing innovative solutions that drive our competitive advantage in the market.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 5,
    "company": "Bidaya Finance",
    "name": "Mahmod bin Salim Dahduli",
    "title": "Chief Executive Officer",
    "quote": "Systems Limited's risk and compliance solutions have strengthened our operational framework while enabling us to expand our services with confidence and regulatory adherence.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 6,
    "company": "Mashreq",
    "name": "Fernando Morillo",
    "title": "Chief Digital Officer",
    "quote": "The application engineering services from Systems Limited have enabled us to develop custom solutions that perfectly align with our business objectives and customer needs.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 7,
    "company": "Bank ABC",
    "name": "Sael Al Waary",
    "title": "Head of Innovation",
    "quote": "Systems Limited's data and AI integration capabilities have transformed how we analyze customer behavior and make strategic decisions, driving significant business growth.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 8,
    "company": "Invest Bank",
    "name": "Ahmad Mohamed Abu Eideh",
    "title": "Chief Technology Officer",
    "quote": "The comprehensive digital transformation delivered by Systems Limited has positioned us as a leader in digital banking innovation within our region.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 9,
    "company": "Samba Bank",
    "name": "Ahmad Tariq Azam",
    "title": "Head of Digital Banking",
    "quote": "Systems Limited's expertise in core modernization has enabled us to reduce operational costs while significantly improving system performance and reliability.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 10,
    "company": "JS Bank",
    "name": "Kamran Sheikh",
    "title": "Chief Information Officer",
    "quote": "The cloud-native solutions implemented by Systems Limited have provided us with the scalability and flexibility needed to adapt to changing market demands quickly.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 11,
    "company": "HBL Strategic Partnership",
    "name": "Andreas Andreades",
    "title": "Head of Strategic Partnerships",
    "quote": "Our partnership with Systems Limited has been transformative, enabling us to leverage cutting-edge technology solutions that drive customer satisfaction and business growth.",
    "logo": "/placeholder.svg?height=48&width=120"
  },
  {
    "id": 12,
    "company": "Telenor Microfinance Bank",
    "name": "Digital Innovation Team",
    "title": "Technology Leadership",
    "quote": "Systems Limited has been our trusted partner in delivering innovative microfinance solutions that reach underserved communities while maintaining operational excellence.",
    "logo": "/placeholder.svg?height=48&width=120"
  }
]
